tutorials/incompressible/icoFoam/mixingPlane/twoBlocksMixingPlane_dirZ_spanY/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5-dev                               |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    top
    {
        type            wall;
        nFaces          20;
        startFace       360;
    }
    bottom
    {
        type            wall;
        nFaces          20;
        startFace       380;
    }
    leftIn
    {
        type            patch;
        nFaces          10;
        startFace       400;
    }
    mixpLeftOut
    {
        type            mixingPlane;
        nFaces          10;
        startFace       410;
        shadowPatch     mixpRightIn;
        orientation dirZ_spanY;         
        assembly both;      
        coordinateSystem
        {
            type coordinateSystem;
            origin (0 0 0.005);
            axis (0 0 1);
            direction (1 0 0);
        }
    }
    mixpRightIn
    {
        type            mixingPlane;
        nFaces          10;
        startFace       420;
        shadowPatch     mixpLeftOut;
        orientation dirZ_spanY;         
        assembly both;      
        coordinateSystem
        {
            type coordinateSystem;
            origin (0 0 0.005);
            axis (0 0 1);
            direction (1 0 0);
        }
    }
    rightOut
    {
        type            patch;
        nFaces          10;
        startFace       430;
    }
    frontAndBack
    {
        type            empty;
        nFaces          400;
        startFace       440;
    }
)

// ************************************************************************* //
